Brumaombra/led-matrix-bitcoin-ticker-esp8266/src/main.cpp
#include <MD_Parola.h>
#include <MD_MAX72xx.h>
#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <ArduinoJson.h>
#include <WiFiClientSecure.h>
#include <LittleFS.h>
#include <ESPAsyncWebServer.h>
#include <EEPROM.h>
#include <StreamUtils.h>
#include <Servo.h>
#include <Utils.h>

#define PRINT(s, x)
#define PRINTS(x)
#define PRINTX(x)

// Hardware configuration
#define HARDWARE_TYPE MD_MAX72XX::FC16_HW
#define BUF_SIZE 250 // Buffer length
#define MAX_DEVICES 16 // Number of modules <- TODO - Change with your data
#define CLK_PIN D5 // SCK <- TODO - Change with your data (If needed)
#define DATA_PIN D7 // MOSI <- TODO - Change with your data (If needed)
#define CS_PIN D8 // SS <- TODO - Change with your data (If needed)
#define EEPROM_SIZE 512 // EEPROM size
#define SERVO_PIN D1 // Servo pin

AsyncWebServer server(80); // Web server
WiFiClient client; // Client object
HTTPClient http; // HTTP object
Servo servoMotor; // Servo object
const char accessPointSSID[] = "Bitcoin-Ticker"; // Access point SSID
char wiFiSSID[35] = ""; // Network SSID
char wiFiPassword[70] = ""; // Network password
char apiKey[35] = ""; // Your API key for financialmodelingprep.com
bool accessPointEnabled = false; // If access point enabled
bool disableAccessPoint = false; // If I need to disable the access point
enum connectionStatus { WIFI_TRY = 2, WIFI_OK = 1, WIFI_KO = 0 }; // Connection status
connectionStatus wiFiConnectionStatus = WIFI_KO; // Connection status
unsigned long currentMillis; // Current time
unsigned long timestampStockData = 0; // Timestamp stock data
unsigned long timestampWiFiConnection = 0; // Timestamp WiFi connection
unsigned long detachServoTimestamp = 0; // Timestamp for detaching the servo motor
enum formatNum { FORMAT_US = 1, FORMAT_EU = 2 }; // Numeric formatting type
formatNum formatType = FORMAT_US; // Current numeric formatting type
enum printType { PRINT_PRICE = 0, PRINT_CHANGE = 1, PRINT_MARKET_CAP = 2, PRINT_DAILY_HIGH_LOW = 3, PRINT_YEAR_HIGH_LOW = 4, PRINT_OPEN = 5, PRINT_VOLUME = 6, PRINT_BITCOIN_MINED = 7 }; // Print type
printType switchText = PRINT_PRICE; // Variable for the switch
MD_Parola P = MD_Parola(HARDWARE_TYPE, CS_PIN, MAX_DEVICES);
uint8_t scrollDelay = 30; // Matrix refresh delay
textEffect_t scrollEffect = PA_SCROLL_LEFT; // Scrolling effect
textPosition_t scrollAlign = PA_LEFT; // Scroll direction
uint16_t scrollPause = 0; // Pause at the end of scrolling
bool currentPriceVisible = true; // Current price visible
bool priceChangeVisible = true; // Price change visible
bool marketCapVisible = true; // Market cap visible
bool dailyHighLowVisible = true; // Daily high/low visible
bool yearHighLowVisible = true; // Year high/low visible
bool openPriceVisible = true; // Open price visible
bool volumeVisible = true; // Volume visible
bool bitcoinMinedVisible = true; // Total bitcoin mined visible
uint16_t priceScrollPause = 30000; // Scroll pause for the current price
bool servoMotorEnabled = true; // If servo motor enabled
bool newDataToSaveToEEPROM = false; // If there is new data to save

// Global message buffers shared by serial and scrolling functions
char currentMessage[BUF_SIZE]; // Current message
char stripMessagePrice[BUF_SIZE]; // Price
char stripMessageDailyChange[BUF_SIZE]; // Change
char stripMessageMarketCap[BUF_SIZE]; // Market Cap
char stripMessageDailyHighLow[BUF_SIZE]; // Daily High/Low
char stripMessageYearHighLow[BUF_SIZE]; // Year High/Low
char stripMessageOpen[BUF_SIZE]; // Open
char stripMessageVolume[BUF_SIZE]; // Volume
char stripMessageBitcoinMined[BUF_SIZE]; // Total Bitcoin mined

// Print the message on the matrix
void printOnLedMatrix(const char* message, const byte stringLength, uint16_t messageStill = scrollPause) {
	stringCopy(currentMessage, message, stringLength); // Copy the message
	P.displayText(currentMessage, scrollAlign, scrollDelay, messageStill, scrollEffect, scrollEffect); // Print the message on the matrix
}

// Read data from the EEPROM
bool readEEPROM(JsonDocument& doc) {
    EepromStream eepromStream(0, EEPROM_SIZE);
	DeserializationError error = deserializeJson(doc, eepromStream);
    if (error) { // Check for errors during deserialization
        Serial.print("Error while reading the EEPROM: ");
        Serial.println(error.c_str()); // Print the error message
        return false;
    }
    return true; // Read success
}

// Write data on the EEPROM
bool writeEEPROM() {
	if (!newDataToSaveToEEPROM) // Check if the data needs to be saved
		return true; // If not exit the function
	EepromStream eepromStream(0, EEPROM_SIZE);
	JsonDocument doc; // JSON object
	if (!readEEPROM(doc)) // Read data from EEPROM
		Serial.println("Overwriting the saved data...");
	if (doc["apiKey"] != apiKey && apiKey[0] != '\0') // Check if the API key is the same
		doc["apiKey"] = apiKey; // Update API key
	if (doc["ssid"] != wiFiSSID && wiFiSSID[0] != '\0') // Check if the WiFi SSID is the same
		doc["ssid"] = wiFiSSID; // Update WiFi SSID
	if (doc["password"] != wiFiPassword) // Check if the WiFi password is the same (Password can be empty)
		doc["password"] = wiFiPassword; // Update WiFi password
	if (doc["currentPriceVisible"] != currentPriceVisible) // Check if the current price visibility is the same
		doc["currentPriceVisible"] = currentPriceVisible; // Update current price visibility
	if (doc["priceChangeVisible"] != priceChangeVisible) // Check if the price change visibility is the same
		doc["priceChangeVisible"] = priceChangeVisible; // Update price change visibility
	if (doc["marketCapVisible"] != marketCapVisible) // Check if the market cap visibility is the same
		doc["marketCapVisible"] = marketCapVisible; // Update market cap visibility
	if (doc["dailyHighLowVisible"] != dailyHighLowVisible) // Check if the daily high/low visibility is the same
		doc["dailyHighLowVisible"] = dailyHighLowVisible; // Update daily high/low visibility
	if (doc["yearHighLowVisible"] != yearHighLowVisible) // Check if the year high/low visibility is the same
		doc["yearHighLowVisible"] = yearHighLowVisible; // Update year high/low visibility
	if (doc["openPriceVisible"] != openPriceVisible) // Check if the open price visibility is the same
		doc["openPriceVisible"] = openPriceVisible; // Update open price visibility
	if (doc["volumeVisible"] != volumeVisible) // Check if the volume visibility is the same
		doc["volumeVisible"] = volumeVisible; // Update volume visibility
	if (doc["bitcoinMinedVisible"] != bitcoinMinedVisible) // Check if the total bitcoin mined visibility is the same
		doc["bitcoinMinedVisible"] = bitcoinMinedVisible; // Update total bitcoin mined visibility
	if (doc["formatType"].as<formatNum>() != formatType) // Check if the formatting type is the same
		doc["formatType"] = formatType; // Update formatting type
	if (doc["priceScrollPause"].as<uint16_t>() != priceScrollPause) // Check if the scroll pause is the same
		doc["priceScrollPause"] = priceScrollPause; // Update scroll pause
	if (!serializeJson(doc, eepromStream))
		return false; // Error while writing on EEPROM
	if (!EEPROM.commit()) // Commit changes
		return false; // Error while committing changes
	newDataToSaveToEEPROM = false; // Mark as saved
	Serial.println("Data saved on EEPROM");
	return true; // Write success
}

// Format currency
void formatCurrency(double value, char* output, const byte length) {
	if (formatType == FORMAT_US)
		stringCopy(output, addThousandsSeparators(value * 100, 2, '.', ','), length);
	else
		stringCopy(output, addThousandsSeparators(value * 100, 2, ',', '.'), length);
}

